# Задание 1 (создать список с разными типами данных)

my_list = ['Дионисий', 28, 79.8, None, True, 'врач']

for el in my_list:
    print(type(el))
# на момент выполнения задания мы еще не имели представления о функциях def. Без гугла и просмотра следующего занятия
# невозможно было догадаться о выполнении этого задания через def. И нужно ли? Если через for in нормально проверяет.
# прокомментируйте на уроке, пожалуйста!
# в гугле вот такой вариант решения:
# def my_type(i):
#     for i in range(len(my_list)):
#         print(type(my_list[i]))
#     return
#
# my_type(my_list)

# Задание 2

# не успел во время выполнить всё домашнее задание в срок. Пожалуйста, разрешите сдать чуть-чуть попозже, буду признателен. Спасибо!

